/** --------------------------------------------------
* @Project	: 蓝风·自由飞行(LF.FreeFlight)
* @Version	: V 1.0
* @Hardware	: STM32F4XX
* @Author	: Xu Zhe
* @Date		: 2021-06-24
* @Brief	: 
---------------------------------------------------*/

/********** 头 文 件 **********/
#include "task.h"

/********** 方    法 **********/
/** --------------------------------------------------
* @Function	: main
* @Brief	: 主函数
* @param	: void
* @return	: int
---------------------------------------------------*/
int main(void)
{
	Sys_Init();			// 系统初始化
	while(1)
	{
		Task_Loop();	// 任务循环
	}
}

/*********** Copyright © 2021 蓝风实验室 ***********/
